// Exam0240.java
// 주제 : 정수 값을 메모리에 저장하는 방법

package com.eomcs.basic.ex03;

class Exam0240 {
    int a = 0xaaaa_aaaa;
    int b = -0xaaaa_aaaa;

    public static void main(String[] args) {
        System.out.println(5 - 3);
        System.out.println(5 + (-3));

        // 0b0000_0011 <= +3 2진수 
        // 0000_0011 > 1111_1100 + 1 > 1111_1101 
        // 0b1111_1101 <= -3 2진수(2의 보수)
        // 0b1000_0011 <= -3 Sign-Magnitude
        // 0b0111_1100 <= -3 Excess-K(bias) = -3 + 127
        // K = 2^(비트수-1 )-1 
        //   = 2^(8-1) - 1
        //   = 128 - 1
        //   = 127


        // 0b0111_1011 <= +123 2진수 
        // 0111_1011 > 1000_0100 + 1 > 1000_0101
        // 0b1000_0101 <= -123 2진수(2의 보수)
        // 0b1111_1011 <= -123 Sign-Magnitude
        // 0b0000_0100 <= -123 Excess-K(bias) = -123 + 127 = 4


        // 0b1010_1010_1010_1010_1010_1010_1010_1010 <= +aaaaaaaa 2진수 
        // 0b0101_0101_0101_0101_0101_0101_0101_0110 <= -123 2진수(2의 보수)
        // = 0x55_55_55_56 
    }
}